ГТС/УТГТС/DataProcessors/ПоискПоТелефону.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПоискПоТелефону</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Результаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТелефона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипВладельца</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

ГТС/УТГТС/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ГТС/УТГТС/Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Document.Встреча</xr:Item>
				<xr:Item>Document.ТелефонныйЗвонок</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоВходящее</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоИсходящее</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>Дата рождения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Comment>Пол</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьУточнение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ASP_Доверенность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ASP_ДолжностьИменпад</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ASP_ДолжностьРодПад</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ASP_ФИОРодПад</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ГТС/УТГТС/DataProcessors/ПоискПоТелефону/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыполнитьПоиск(Команда)
	
	ТекСтрокаИсходная		=	СокрЛП(СтрокаПоиска);
		
		ТекСтрокаТолькоЦифры	=	"";
		
		// (
		
		Для ТекНомерСимвола = 1 По СтрДлина(ТекСтрокаИсходная) Цикл
			
			ТекСимвол	=	Сред(ТекСтрокаИсходная, ТекНомерСимвола, 1);
		
			Если	Найти("0123456789", ТекСимвол) > 0	Тогда
			
				ТекСтрокаТолькоЦифры	=	ТекСтрокаТолькоЦифры	+	ТекСимвол;
			
			КонецЕсли;
		
		КонецЦикла;
	
	Объект.Результаты.Очистить();	
	
	Контакты = ЗагрузитьСписокКонтактовТелефонКоторыхСодержитСтрокуПоиска(ТекСтрокаТолькоЦифры);
	
	Для Каждого Элемент Из Контакты Цикл
		
		Для Каждого Владелец Из Элемент.Значение Цикл
			НовСтрока				=	Объект.Результаты.Добавить();
			НовСтрока.Телефон 		=	Элемент.Ключ;
			НовСтрока.ТипТелефона 	=	Владелец.ТипТелефона;
			НовСтрока.Владелец 		=	Владелец.Ссылка;
			НовСтрока.ТипВладельца  =	Владелец.ТипВладельца;
		КонецЦикла;	
		
    КонецЦикла;

	
КонецПроцедуры

&НаКлиенте
Процедура РезультатыВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	ТипыЗначений = Новый Соответствие;
	ТипыЗначений.Вставить(Строка(Тип("СправочникСсылка.Организации")),				"Справочник.Организации.ФормаОбъекта");
	ТипыЗначений.Вставить(Строка(Тип("СправочникСсылка.Пользователи")),				"Справочник.Пользователи.ФормаОбъекта");
	ТипыЗначений.Вставить(Строка(Тип("СправочникСсылка.Контрагенты")),				"Справочник.Контрагенты.ФормаОбъекта");
	ТипыЗначений.Вставить(Строка(Тип("СправочникСсылка.Партнеры")),					"Справочник.Партнеры.ФормаОбъекта");
	ТипыЗначений.Вставить(Строка(Тип("СправочникСсылка.КонтактныеЛицаПартнеров")),	"Справочник.КонтактныеЛицаПартнеров.ФормаОбъекта");
	ТипыЗначений.Вставить(Строка(Тип("СправочникСсылка.ФизическиеЛица")),			"Справочник.ФизическиеЛица.ФормаОбъекта");
	
	Владелец = Элемент.ТекущиеДанные.Владелец;
	Пр = Новый Структура;
    Пр.Вставить("Ключ", Владелец);
    ОткрытьФорму(ТипыЗначений.Получить(Строка(ТипЗнч(Владелец))), Пр);
	СтандартнаяОбработка	=	Ложь;
	
КонецПроцедуры
 
&НаСервере
Функция	ЗагрузитьСписокКонтактовТелефонКоторыхСодержитСтрокуПоиска(СтрокаПоиска)
	УстановитьПривилегированныйРежим(Истина);

	
	СписокТелефонов	=	Новый	Соответствие;
	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст	=	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	            	 	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка КАК Ссылка,
	            	 	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Вид КАК Вид,
	            	 	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Представление КАК Представление,
	            	 	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
	            	 	|	ВЫБОР
	            	 	|		КОГДА КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона <> """"
	            	 	|			ТОГДА ""Контактное лицо""
	            	 	|	КОНЕЦ КАК ТипВладельца
	            	 	|ИЗ
	            	 	|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
	            	 	|
	            	 	|ОБЪЕДИНИТЬ ВСЕ
	            	 	|
	            	 	|ВЫБРАТЬ
	            	 	|	КонтрагентыКонтактнаяИнформация.Ссылка,
	            	 	|	КонтрагентыКонтактнаяИнформация.Вид,
	            	 	|	КонтрагентыКонтактнаяИнформация.Представление,
	            	 	|	КонтрагентыКонтактнаяИнформация.НомерТелефона,
	            	 	|	ВЫБОР
	            	 	|		КОГДА КонтрагентыКонтактнаяИнформация.НомерТелефона <> """"
	            	 	|			ТОГДА ""Контрагент""
	            	 	|	КОНЕЦ
	            	 	|ИЗ
	            	 	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	            	 	|
	            	 	|ОБЪЕДИНИТЬ ВСЕ
	            	 	|
	            	 	|ВЫБРАТЬ
	            	 	|	ОрганизацииКонтактнаяИнформация.Ссылка,
	            	 	|	ОрганизацииКонтактнаяИнформация.Вид,
	            	 	|	ОрганизацииКонтактнаяИнформация.Представление,
	            	 	|	ОрганизацииКонтактнаяИнформация.НомерТелефона,
	            	 	|	ВЫБОР
	            	 	|		КОГДА ОрганизацииКонтактнаяИнформация.НомерТелефона <> """"
	            	 	|			ТОГДА ""Организация""
	            	 	|	КОНЕЦ
	            	 	|ИЗ
	            	 	|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	            	 	|
	            	 	|ОБЪЕДИНИТЬ ВСЕ
	            	 	|
	            	 	|ВЫБРАТЬ
	            	 	|	ПартнерыКонтактнаяИнформация.Ссылка,
	            	 	|	ПартнерыКонтактнаяИнформация.Вид,
	            	 	|	ПартнерыКонтактнаяИнформация.Представление,
	            	 	|	ПартнерыКонтактнаяИнформация.НомерТелефона,
	            	 	|	ВЫБОР
	            	 	|		КОГДА ПартнерыКонтактнаяИнформация.НомерТелефона <> """"
	            	 	|			ТОГДА ""Партнер""
	            	 	|	КОНЕЦ
	            	 	|ИЗ
	            	 	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	            	 	|
	            	 	|ОБЪЕДИНИТЬ ВСЕ
	            	 	|
	            	 	|ВЫБРАТЬ
	            	 	|	ПользователиКонтактнаяИнформация.Ссылка,
	            	 	|	ПользователиКонтактнаяИнформация.Вид,
	            	 	|	ПользователиКонтактнаяИнформация.Представление,
	            	 	|	ПользователиКонтактнаяИнформация.НомерТелефона,
	            	 	|	ВЫБОР
	            	 	|		КОГДА ПользователиКонтактнаяИнформация.НомерТелефона <> """"
	            	 	|			ТОГДА ""Пользователь""
	            	 	|	КОНЕЦ
	            	 	|ИЗ
	            	 	|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	            	 	|
	            	 	|ОБЪЕДИНИТЬ ВСЕ
	            	 	|
	            	 	|ВЫБРАТЬ
	            	 	|	ФизическиеЛицаКонтактнаяИнформация.Ссылка,
	            	 	|	ФизическиеЛицаКонтактнаяИнформация.Вид,
	            	 	|	ФизическиеЛицаКонтактнаяИнформация.Представление,
	            	 	|	ФизическиеЛицаКонтактнаяИнформация.НомерТелефона,
	            	 	|	ВЫБОР
	            	 	|		КОГДА ФизическиеЛицаКонтактнаяИнформация.НомерТелефона <> """"
	            	 	|			ТОГДА ""Физическое лицо""
	            	 	|	КОНЕЦ
	            	 	|ИЗ
	            	 	|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация";
		
	Выборка		=	Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если СтрДлина(Выборка.НомерТелефона) <=0 Тогда		
			Продолжить;			
		КонецЕсли; 
		
		МассивНомеров	=	ПолучитьМассивИзСтрокиТелефонов(Выборка.Представление);
		
		Для К = 0 По МассивНомеров.Количество() - 1 Цикл
			
			НомерТелефона		=	МассивНомеров[К];	
			
			Если СтрЧислоВхождений(НомерТелефона, СтрокаПоиска) = 0 Тогда
				Продолжить;
            КонецЕсли;
			
			МассивВладельцев	=	СписокТелефонов.Получить(НомерТелефона);
			
			Если	МассивВладельцев	=	Неопределено	Тогда
			
				МассивВладельцев		=	Новый	Массив;
			
			КонецЕсли;
			
			Владелец =	Новый	Структура;
			Владелец.Вставить("ТипТелефона", Выборка.Вид);
			Владелец.Вставить("Ссылка", Выборка.Ссылка);
			Владелец.Вставить("ТипВладельца", Выборка.ТипВладельца);				
			МассивВладельцев.Добавить(Владелец);
					
			СписокТелефонов.Вставить(НомерТелефона, МассивВладельцев);
		
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат	СписокТелефонов;

КонецФункции

&НаСервере
Функция	ПолучитьМассивИзСтрокиТелефонов(Знач СтрокаТелефоны, МассивНомеровПредставление = Неопределено)
	УстановитьПривилегированныйРежим(Истина);

	СтрокаТелефоны	=	СтрЗаменить(СтрокаТелефоны, ".", ",");
	СтрокаТелефоны	=	СтрЗаменить(СтрокаТелефоны, ";", ",");
	
	
	МассивПодстрок	=	СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаТелефоны, ",");
	
	МассивНомеров				=	Новый	Массив;
	МассивНомеровПредставление	=	Новый	Массив;
	
	Для К = 0 По МассивПодстрок.Количество() - 1 Цикл
		
		ТекСтрокаИсходная		=	СокрЛП(МассивПодстрок[К]);
		
		ТекСтрокаТолькоЦифры	=	"";
		
		// (
		
		Для ТекНомерСимвола = 1 По СтрДлина(ТекСтрокаИсходная) Цикл
			
			ТекСимвол	=	Сред(ТекСтрокаИсходная, ТекНомерСимвола, 1);
		
			Если	Найти("0123456789", ТекСимвол) > 0	Тогда
			
				ТекСтрокаТолькоЦифры	=	ТекСтрокаТолькоЦифры	+	ТекСимвол;
			
			КонецЕсли;
		
		КонецЦикла;
		
		// )
		
		Если	НЕ ПустаяСтрока(ТекСтрокаТолькоЦифры)	Тогда
		
			МассивНомеров.Добавить(ТекСтрокаТолькоЦифры);
			МассивНомеровПредставление.Добавить(ТекСтрокаИсходная + "   |   " + ТекСтрокаТолькоЦифры + "");
		
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат	МассивНомеров;

КонецФункции


&НаКлиенте
Процедура ПриЗакрытии()
	
	Форма				=	ПолучитьФорму("ВнешняяОбработка.ПоискПоТелефону.Форма.ФормаОтзыва");
	
	Форма.Разработка	=	"ПоискПоТелефону";
	
	Форма.Открыть();

КонецПроцедуры
